lambda/src/test/resources/DigiSubs2023/monthly/discounted/account.json

{
  "basicInfo" : {
    "id" : "ACCOUNT-ID",
    "name" : "ACCOUNT-NAME",
    "accountNumber" : "ACCOUNT-NUMBER",
    "notes" : null,
    "status" : "Active",
    "crmId" : "ACCOUNT-NAME",
    "batch" : "Batch1",
    "invoiceTemplateId" : "2c92a0fb49377eae014951ca848e074b",
    "communicationProfileId" : null,
    "profileNumber" : null,
    "purchaseOrderNumber" : null,
    "customerServiceRepName" : null,
    "IdentityId__c" : "109370669",
    "sfContactId__c" : "0035I00000eLzeQQAS",
    "CCURN__c" : null,
    "SpecialDeliveryInstructions__c" : null,
    "NonStandardDataReason__c" : null,
    "ProcessingAdvice__c" : "NoAdvice",
    "CreatedRequestId__c" : "5fa091db-5c62-2b04-0000-000000002db4",
    "RetryStatus__c" : null,
    "salesRep" : null,
    "sequenceSetId" : null
  },
  "billingAndPayment" : {
    "billCycleDay" : 19,
    "currency" : "GBP",
    "paymentTerm" : "Due Upon Receipt",
    "paymentGateway" : "PayPal Express",
    "paymentGatewayNumber" : "PG-00000006",
    "defaultPaymentMethodId" : "8a12894e8ae6c727018af5114b2e3da4",
    "invoiceDeliveryPrefsPrint" : false,
    "invoiceDeliveryPrefsEmail" : false,
    "autoPay" : true,
    "additionalEmailAddresses" : [ ]
  },
  "metrics" : {
    "balance" : 0.000000000,
    "totalInvoiceBalance" : 0.000000000,
    "creditBalance" : 0.000000000,
    "contractedMrr" : 12.420000000
  },
  "billToContact" : null,
  "soldToContact" : null,
  "taxInfo" : null,
  "success" : true
}