lambda/src/test/resources/DigiSubs2023/regular/subscription.json

{
  "success" : true,
  "id" : "SUBSCRIPTION-NUMBER",
  "accountId" : "ACCOUNT-ID",
  "accountNumber" : "ACCOUNT-NUMBER",
  "accountName" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountId" : "ACCOUNT-ID",
  "invoiceOwnerAccountNumber" : "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName" : "ACCOUNT-NUMBER",
  "subscriptionNumber" : "ACCOUNT-NUMBER",
  "version" : 8,
  "revision" : "8.0",
  "termType" : "TERMED",
  "invoiceSeparately" : false,
  "contractEffectiveDate" : "2014-09-11",
  "serviceActivationDate" : "2014-09-11",
  "customerAcceptanceDate" : "2016-06-28",
  "subscriptionStartDate" : "2016-06-28",
  "subscriptionEndDate" : "2024-06-28",
  "lastBookingDate" : "2023-06-28",
  "termStartDate" : "2023-06-28",
  "termEndDate" : "2024-06-28",
  "initialTerm" : 12,
  "initialTermPeriodType" : "Month",
  "currentTerm" : 12,
  "currentTermPeriodType" : "Month",
  "autoRenew" : true,
  "renewalSetting" : "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm" : 12,
  "renewalTermPeriodType" : "Month",
  "contractedMrr" : 11.99,
  "totalContractedValue" : 1151.04,
  "notes" : null,
  "status" : "Active",
  "TrialPeriodPrice__c" : null,
  "CanadaHandDelivery__c" : null,
  "QuoteNumber__QT" : null,
  "GifteeIdentityId__c" : null,
  "OpportunityName__QT" : null,
  "GiftNotificationEmailDate__c" : null,
  "Gift_Subscription__c" : "No",
  "TrialPeriodDays__c" : null,
  "CreatedRequestId__c" : null,
  "AcquisitionSource__c" : null,
  "CreatedByCSR__c" : null,
  "CASSubscriberID__c" : null,
  "LastPriceChangeDate__c" : null,
  "InitialPromotionCode__c" : null,
  "CpqBundleJsonId__QT" : null,
  "RedemptionCode__c" : null,
  "QuoteType__QT" : null,
  "GiftRedemptionDate__c" : null,
  "QuoteBusinessType__QT" : null,
  "SupplierCode__c" : null,
  "legacy_cat__c" : null,
  "DeliveryAgent__c" : null,
  "AcquisitionCase__c" : null,
  "ReaderType__c" : null,
  "ActivationDate__c" : "2016-07-06T07:19:25.572Z",
  "UserCancellationReason__c" : null,
  "OpportunityCloseDate__QT" : null,
  "IPaddress__c" : null,
  "IPCountry__c" : null,
  "PromotionCode__c" : "DGA01",
  "OriginalSubscriptionStartDate__c" : null,
  "LegacyContractStartDate__c" : null,
  "CancellationReason__c" : null,
  "billToContact" : null,
  "paymentTerm" : null,
  "invoiceTemplateId" : null,
  "invoiceTemplateName" : null,
  "sequenceSetId" : null,
  "sequenceSetName" : null,
  "soldToContact" : null,
  "isLatestVersion" : true,
  "cancelReason" : null,
  "ratePlans" : [ {
    "id" : "8a12822d88f6dea80189006c5aa90928",
    "productId" : "2c92a0fb4edd70c8014edeaa4ddb21e7",
    "productName" : "Digital Pack",
    "productSku" : "ABC-00000005",
    "productRatePlanId" : "2c92a0fb4edd70c8014edeaa4eae220a",
    "productRatePlanNumber" : null,
    "ratePlanName" : "Digital Pack Monthly",
    "subscriptionProductFeatures" : [ ],
    "externallyManagedPlanId" : null,
    "subscriptionRatePlanNumber" : null,
    "ratePlanCharges" : [ {
      "id" : "8a12822d88f6dea80189006c5aac092a",
      "originalChargeId" : "2c92a0fd55a0dc780155bc08a92d02cc",
      "productRatePlanChargeId" : "2c92a0fb4edd70c9014edeaa50342192",
      "number" : "C-00293574",
      "name" : "Digital Pack Monthly",
      "productRatePlanChargeNumber" : null,
      "type" : "Recurring",
      "model" : "FlatFee",
      "uom" : null,
      "version" : 8,
      "priceChangeOption" : "NoChange",
      "priceIncreasePercentage" : null,
      "currency" : "GBP",
      "chargeModelConfiguration" : null,
      "inputArgumentId" : null,
      "includedUnits" : null,
      "overagePrice" : null,
      "applyDiscountTo" : null,
      "discountLevel" : null,
      "discountClass" : null,
      "billingDay" : "ChargeTriggerDay",
      "listPriceBase" : "Per_Billing_Period",
      "specificListPriceBase" : null,
      "billingPeriod" : "Month",
      "specificBillingPeriod" : null,
      "billingTiming" : "IN_ADVANCE",
      "ratingGroup" : null,
      "billingPeriodAlignment" : "AlignToCharge",
      "quantity" : 1.000000000,
      "smoothingModel" : null,
      "numberOfPeriods" : null,
      "overageCalculationOption" : null,
      "overageUnusedUnitsCreditOption" : null,
      "unusedUnitsCreditRates" : null,
      "usageRecordRatingOption" : null,
      "segment" : 1,
      "effectiveStartDate" : "2016-06-28",
      "effectiveEndDate" : "2024-06-28",
      "processedThroughDate" : "2023-09-28",
      "chargedThroughDate" : "2023-10-28",
      "done" : false,
      "triggerDate" : null,
      "triggerEvent" : "CustomerAcceptance",
      "endDateCondition" : "Subscription_End",
      "upToPeriodsType" : null,
      "upToPeriods" : null,
      "specificEndDate" : null,
      "mrr" : 11.990000000,
      "dmrc" : 0.000000000,
      "tcv" : 1151.040000000,
      "dtcv" : 143.880000000,
      "originalOrderDate" : "2016-07-05",
      "amendedByOrderOn" : "2023-06-28",
      "description" : "Migrated sub",
      "HolidayStart__c" : null,
      "HolidayEnd__c" : null,
      "ForceSync__c" : null,
      "tiers" : null,
      "discountApplyDetails" : null,
      "pricingSummary" : "GBP11.99",
      "price" : 11.990000000,
      "discountAmount" : null,
      "discountPercentage" : null
    } ]
  } ],
  "orderNumber" : "O-00983510",
  "externallyManagedBy" : null,
  "statusHistory" : [ {
    "startDate" : "2016-06-28",
    "endDate" : "2024-06-28",
    "status" : "Active"
  }, {
    "startDate" : "2024-06-28",
    "endDate" : null,
    "status" : "OutOfTerm"
  } ]
}